stm32duino/Arduino_Core_STM32/system/Middlewares/ST/STM32_USB_Device_Library/Core/Inc/usbd_conf_template.h
/**
  ******************************************************************************
  * @file    usbd_conf_template.h
  * @author  MCD Application Team
  * @brief   Header file for the usbd_conf_template.c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      http://www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USBD_CONF_TEMPLATE_H
#define __USBD_CONF_TEMPLATE_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* replace 'stm32xxx' with your HAL driver header filename, ex: stm32f4xx.h */
#include "stm32fxxx.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/** @addtogroup STM32_USB_DEVICE_LIBRARY
  * @{
  */

/** @defgroup USBD_CONF
  * @brief USB device low level driver configuration file
  * @{
  */

/** @defgroup USBD_CONF_Exported_Defines
  * @{
  */

#define USBD_MAX_NUM_INTERFACES    1U
#define USBD_MAX_NUM_CONFIGURATION 1U
#define USBD_MAX_STR_DESC_SIZ      0x100U
#define USBD_SUPPORT_USER_STRING   0U
#define USBD_SELF_POWERED          1U
#define USBD_DEBUG_LEVEL           2U

/* MSC Class Config */
#define MSC_MEDIA_PACKET           8192U

/* CDC Class Config */
#define USBD_CDC_INTERVAL          2000U

/* DFU Class Config */
#define USBD_DFU_MAX_ITF_NUM       1U
#define USBD_DFU_XFERS_IZE         1024U

/* AUDIO Class Config */
#define USBD_AUDIO_FREQ            22100U

/** @defgroup USBD_Exported_Macros
  * @{
  */

/* Memory management macros */
#define USBD_malloc                malloc
#define USBD_free                  free
#define USBD_memset                memset
#define USBD_memcpy                memcpy

/* DEBUG macros */
#if (USBD_DEBUG_LEVEL > 0U)
#define USBD_UsrLog(...) do { \
                           printf(__VA_ARGS__); \
                           printf("\n"); \
                         } while (0)
#else
#define USBD_UsrLog(...) do {} while (0)
#endif

#if (USBD_DEBUG_LEVEL > 1U)

#define USBD_ErrLog(...) do { \
                           printf("ERROR: "); \
                           printf(__VA_ARGS__); \
                           printf("\n"); \
                         } while (0)
#else
#define USBD_ErrLog(...) do {} while (0)
#endif

#if (USBD_DEBUG_LEVEL > 2U)
#define USBD_DbgLog(...) do { \
                           printf("DEBUG : ");  \
                           printf(__VA_ARGS__); \
                           printf("\n"); \
                         } while (0)
#else
#define USBD_DbgLog(...) do {} while (0)
#endif

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup USBD_CONF_Exported_Types
  * @{
  */

/**
  * @}
  */

/** @defgroup USBD_CONF_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup USBD_CONF_Exported_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup USBD_CONF_Exported_FunctionsPrototype
  * @{
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __USBD_CONF_TEMPLATE_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
